plantsproj/app/controllers/plants_controller.rb

  def index
    @plants = Plant.all
---
SELECT "plants".* FROM "plants"

    def find_user
      if params[:user_id]
        @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 17 LIMIT 1